taskt/Core/Automation/Commands/FolderGroup/CopyFolderInSamLocationCommand.dot
digraph "CopyFolderInSamLocationCommand" {
"CopyFolderInSamLocationCommand" -> "AFolderCopySameRenameFolderCommands";
"CopyFolderInSamLocationCommand" -> "IFolderCopyFolderProperties";
"AFolderCopySameRenameFolderCommands" -> "AFolderExistsFolderBeforeAfterResultCommands";
"AFolderCopySameRenameFolderCommands" -> "ICanHandleFolderName";
"AFolderExistsFolderBeforeAfterResultCommands" -> "AFolderExistsFolderPathCommands";
"AFolderExistsFolderBeforeAfterResultCommands" -> "IFolderExistsFolderPathBeforeAfterPathResultProperties";
"AFolderExistsFolderPathCommands" -> "AFolderFolderPathCommands";
"AFolderExistsFolderPathCommands" -> "IFolderExistsFolderPathProperties";
"AFolderFolderPathCommands" -> "ScriptCommand";
"AFolderFolderPathCommands" -> "IFolderPathProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
